app/views/conditions/show.html.erb

SELECT "studies".* FROM "studies" INNER JOIN "conditions_studies" ON "studies"."id" = "conditions_studies"."study_id" WHERE "conditions_studies"."condition_id" = ?  [["condition_id", 1]]
---
<h2>Studies</h2>
  <% @condition.studies.each do |study| %>