app/views/investigators/show.html.erb

<h2>Study</h2>
  <% @investigator.studies.each do |study|%>
---
SELECT "studies".* FROM "studies" INNER JOIN "investigators_studies" ON "studies"."id" = "investigators_studies"."study_id" WHERE "investigators_studies"."investigator_id" = ?  [["investigator_id", 1]]