app/views/investigators/show.html.erb

<p><strong>Specialties:</strong></p>
  <ul><% @investigator.conditions.each do |condition|%>
---
SELECT  "conditions".* FROM "conditions" WHERE "conditions"."condition_id" = ? LIMIT ?  [["condition_id", 2674], ["LIMIT", 1]]