app/views/studies/show.html.erb

  <h3>Condition</h3>
  <% @study.conditions.each do |condition| %><br>
---
SELECT "conditions".* FROM "conditions" INNER JOIN "conditions_studies" ON "conditions"."id" = "conditions_studies"."condition_id" WHERE "conditions_studies"."study_id" = ?  [["study_id", 1]]

<h3>Interventions</h3>
  <% @study.interventions.each do |intervention| %><br>
---
SELECT "interventions".* FROM "interventions" INNER JOIN "interventions_studies" ON "interventions"."id" = "interventions_studies"."intervention_id" WHERE "interventions_studies"."study_id" = ?  [["study_id", 1]]

<h3>Investigators</h3>
<% @study.investigators.each do |investigator| %><br>
---
SELECT "investigators".* FROM "investigators" INNER JOIN "investigators_studies" ON "investigators"."id" = "investigators_studies"."investigator_id" WHERE "investigators_studies"."study_id" = ?  [["study_id", 1]]