app/views/interventions/show.html.erb

	<h2>Studies</h2>
	<p><%= link_to @intervention.study_name, study_path(@intervention.studies.ids) %><p>
---
SELECT "studies".* FROM "studies" INNER JOIN "interventions_studies" ON "studies"."id" = "interventions_studies"."study_id" WHERE "interventions_studies"."intervention_id" = ?  [["intervention_id", 1]]