app/controllers/conditions_controller.rb

SELECT  "conditions".* FROM "conditions" WHERE "conditions"."condition_id" = ? LIMIT ?  [["condition_id", 1], ["LIMIT", 1]]
---
    def set_condition
      @condition = Condition.find(params[:id])