app/controllers/interventions_controller.rb

SELECT "interventions".* FROM "interventions"
---
  def index
    @interventions = Intervention.all

INSERT INTO "interventions" DEFAULT VALUES
---
  def create
    @intervention = Intervention.new(intervention_params)

    respond_to do |format|
      if @intervention.save

SELECT  "interventions".* FROM "interventions" WHERE "interventions"."intervention_id" = ? LIMIT ?  [["intervention_id", 3457], ["LIMIT", 1]]
---
    def set_intervention
      @intervention = Intervention.find(params[:id])