app/controllers/investigators_controller.rb

INSERT INTO "investigators" DEFAULT VALUES
---
  def create
    @investigator = Investigator.new(investigator_params)

    respond_to do |format|
      if @investigator.save