app/controllers/investigators_controller.rb

SELECT "investigators".* FROM "investigators"
---
	def index
		@investigators = Investigator.all

SELECT  "investigators".* FROM "investigators" WHERE "investigators"."investigator_id" = ? LIMIT ?  [["investigator_id", 1], ["LIMIT", 1]]
---
	def find_investigator
		@investigator = Investigator.find(params[:id])