app/controllers/studies_controller.rb

SELECT "studies".* FROM "studies"
---
  def index
    @studies = Study.all

INSERT INTO "studies" DEFAULT VALUES
---
  def create
    @study = Study.new(study_params)

    respond_to do |format|
      if @study.save

SELECT  "studies".* FROM "studies" WHERE "studies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_study
      @study = Study.find(params[:id])