app/models/intervention.rb

SELECT  "studies".* FROM "studies" WHERE "studies"."id" = ? LIMIT ?  [["id", 1341], ["LIMIT", 1]]
---
  def find_study
    Study.find(study_id)

SELECT "conditions"."id" FROM "conditions" INNER JOIN "conditions_studies" ON "conditions"."id" = "conditions_studies"."condition_id" WHERE "conditions_studies"."study_id" = ?  [["study_id", 493]]
---
  def find_condition
    self.find_study.conditions.ids