app/models/investigator.rb

def specialty_diseases
  conditionArray = conditions.map {|condition| condition.CONDITION}
  conditionString = conditionArray.join(', ')
---
SELECT  "conditions".* FROM "conditions" WHERE "conditions"."condition_id" = ? LIMIT ?  [["condition_id", 2674], ["LIMIT", 1]]