app/models/investigator.rb

SELECT  "study_investigators".* FROM "study_investigators" WHERE "study_investigators"."investigator_id" = ? LIMIT ?  [["investigator_id", 1], ["LIMIT", 1]]
---
  def find_study_id
  	StudyInvestigator.find_by(investigator_id: find_investigator).study_id

SELECT  "studies".* FROM "studies" WHERE "studies"."study_id" = ? LIMIT ?  [["study_id", "NCT03453541"], ["LIMIT", 1]]
---
  def find_study
  	Study.find_by(study_id: find_study_id)

SELECT  "study_conditions".* FROM "study_conditions" WHERE "study_conditions"."study_id" = ? LIMIT ?  [["study_id", "NCT03453541"], ["LIMIT", 1]]
---
  def find_conditions
  	StudyCondition.find_by(study_id: find_study_id).condition.CONDITION

SELECT "interventions".* FROM "interventions" INNER JOIN "interventions_studies" ON "interventions"."id" = "interventions_studies"."intervention_id" WHERE "interventions_studies"."study_id" = ?  [["study_id", 108]]
SELECT  "study_interventions".* FROM "study_interventions" WHERE "study_interventions"."study_id" = ? LIMIT ?  [["study_id", "NCT03453541"], ["LIMIT", 1]]
---
  def find_interventions
  	StudyIntervention.find_by(study_id: find_study_id).intervention.INTERVENTION_NAME