app/models/study.rb

	def investigators_name
		self.find_investigators.map do |investigators|
---
SELECT  "investigators".* FROM "investigators" WHERE "investigators"."investigator_id" = ? LIMIT ?  [["investigator_id", 1369], ["LIMIT", 1]]

	def investigator
		self.investigators_name.join(", ")
---
SELECT "investigators".* FROM "investigators" INNER JOIN "investigators_studies" ON "investigators"."id" = "investigators_studies"."investigator_id" WHERE "investigators_studies"."study_id" = ?  [["study_id", 1]]